daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
//*****************************************************************************
//
// main.c - TM4C123G DAQ with USB CDC streaming
//
// Hardware: EK-TM4C123GXL (Tiva C Series LaunchPad)
// MCU:      TM4C123GH6PM, ARM Cortex-M4F @ 80MHz
//
// USB CDC virtual COM port streams 12-bit ADC samples at configurable rate.
// Connect device USB port (J2, side micro-B) to PC for data.
// Debug USB port (J1, top micro-B) for programming.
//
// Pin assignments:
//   PD4/PD5 - USB D-/D+ (device port J2)
//   PE3     - ADC0 AIN0 (analog input)
//   PB6     - M0PWM0 (PWM test output, wire to PE3 for self-test)
//   PF1     - Red LED (heartbeat)
//   PF2     - Blue LED (USB connected)
//   PF3     - Green LED (ADC activity)
//   PF4     - SW1 button (cycle PWM frequency)
//   PF0     - SW2 button (cycle PWM duty)
//
// Binary protocol (3 bytes per 2 × 12-bit samples):
//   Byte 0:  sA[11:4]  — clamped to 0xFE max; 0xFF reserved for commands
//   Byte 1:  sA[3:0] | sB[11:8]   (nibble boundary)
//   Byte 2:  sB[7:0]
//   Decode:  sA = (b0 << 4) | (b1 >> 4)
//            sB = ((b1 & 0x0F) << 8) | b2
//   Note:    sA is clipped at 4079 (3.287 V) to keep 0xFF free for framing
//
// Command packets (3 bytes, triplet-aligned):
//   [0xFF] [0x20 | freq_index] [0x00]   PWM frequency changed
//   [0xFF] [0x40 | duty_index] [0x00]   PWM duty changed
//   [0xFF] [0x60 | rate_index] [0x00]   ADC sample rate changed
//   [0xFF] [0x80 | oflow[11:8]] [oflow[7:0]]  ADC overflow delta report
//   [0xFF] [0xA0 | recoveries[3:0]] [0x00]     Acquisition stall recovered
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "driverlib/adc.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include "driverlib/udma.h"
#include "driverlib/usb.h"
#include "inc/hw_adc.h"
#include "inc/hw_udma.h"
#include "usblib/usblib.h"
#include "usblib/usbcdc.h"
#include "usblib/usb-ids.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdcdc.h"
#include "usb_serial_structs.h"

//*****************************************************************************
// Configuration
//*****************************************************************************
#define SYSTICKS_PER_SECOND     100
#define SYS_CLOCK_HZ            80000000

// ADC circular buffer (power of 2, sized for 500kHz DMA streaming)
#define ADC_BUFFER_SIZE         8192
#define ADC_BUFFER_MASK         (ADC_BUFFER_SIZE - 1)

// Acquisition watchdog: SysTick ticks of no new samples before we assume the
// uDMA ping-pong has stalled and rebuild it.  At the slowest preset (100 kS/s)
// a buffer completes every 2.6 ms, so 10 ticks (100 ms) cannot false-trip.
#define WATCHDOG_TICKS          10

//*****************************************************************************
// PWM frequency presets — logarithmic spread from 100 Hz to 500 kHz
//
// PWM counter is 16-bit (max period 65536), so we select the clock divider
// per-frequency to keep good duty cycle resolution at all ranges.
//
//   Freq      Divider   PWM Clock    Period   Min duty step
//   100 Hz    /64       1.25 MHz     12500    0.008%
//   1 kHz     /2        40 MHz       40000    0.0025%
//   10 kHz    /1        80 MHz       8000     0.0125%
//   20 kHz    /1        80 MHz       4000     0.025%
//   40 kHz    /1        80 MHz       2000     0.05%
//*****************************************************************************
#define NUM_FREQ_PRESETS    5

typedef struct {
    uint32_t ui32FreqHz;
    uint32_t ui32ClkDiv;        // SYSCTL_PWMDIV_x
    uint32_t ui32Period;        // PWM clock ticks per cycle
} tPWMFreqPreset;

static const tPWMFreqPreset g_psFreqPresets[NUM_FREQ_PRESETS] = {
    {    100, SYSCTL_PWMDIV_64, 12500 },
    {   1000, SYSCTL_PWMDIV_2,  40000 },
    {  10000, SYSCTL_PWMDIV_1,   8000 },
    {  20000, SYSCTL_PWMDIV_1,   4000 },
    {  40000, SYSCTL_PWMDIV_1,   2000 },
};

//*****************************************************************************
// ADC sample-rate presets
//*****************************************************************************
#define NUM_SAMPLE_RATE_PRESETS 5

static const uint32_t g_pui32SampleRateHz[NUM_SAMPLE_RATE_PRESETS] = {
    100000,
    200000,
    250000,
    333333,
    400000,
};

//*****************************************************************************
// PWM duty cycle presets (percent)
//*****************************************************************************
#define NUM_DUTY_PRESETS    5
static const uint8_t g_pui8DutyPercent[NUM_DUTY_PRESETS] = {10, 25, 50, 75, 90};

//*****************************************************************************
// Global state
//*****************************************************************************

// ADC sample circular buffer
static volatile uint16_t g_pui16ADCBuffer[ADC_BUFFER_SIZE];
static volatile uint32_t g_ui32ADCHead = 0;
static volatile uint32_t g_ui32ADCTail = 0;
static volatile uint32_t g_ui32ADCOverflow = 0;
static volatile uint32_t g_ui32SampleCount = 0;
static volatile uint32_t g_ui32OverflowReported = 0;

// Acquisition watchdog state (g_ui32WatchdogLast/Ticks are SysTick-private)
static volatile bool     g_bPipelineStalled = false;
static volatile uint32_t g_ui32StallRecoveries = 0;
static uint32_t          g_ui32WatchdogLast = 0;
static uint8_t           g_ui8WatchdogTicks = 0;

// System state
static volatile uint32_t g_ui32SysTickCount = 0;
volatile bool g_bUSBConfigured = false;

// PWM state
static volatile uint8_t g_ui8FreqIndex = 2;    // Start at 10 kHz
static volatile uint8_t g_ui8DutyIndex = 2;    // Start at 50%
static volatile uint8_t g_ui8SampleRateIndex = 1; // Start at 200 kS/s

// Button debounce (two buttons)
#define BTN_FREQ    0       // SW1 (PF4) - cycle frequency
#define BTN_DUTY    1       // SW2 (PF0) - cycle duty
#define DEBOUNCE_TICKS  8   // 80ms at 100Hz SysTick

