daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
static struct {
    uint8_t  ui8State;      // Debounced state (1=released, active low)
    uint8_t  ui8Count;      // Debounce counter
    volatile bool bPressed; // Set on press, cleared by main loop
} g_sButtons[2] = {
    {1, 0, false},          // SW1
    {1, 0, false},          // SW2
};

// PC command state (set by RxHandler, processed in main loop)
static volatile bool g_bCmdFreq = false;
static volatile bool g_bCmdDuty = false;
static volatile bool g_bCmdSampleRate = false;
static volatile uint8_t g_ui8CmdFreqIndex = 0;
static volatile uint8_t g_ui8CmdDutyIndex = 0;
static volatile uint8_t g_ui8CmdSampleRateIndex = 0;

// USB batch write buffer for high-throughput streaming
// Must be a multiple of 3 (3 bytes per 2-sample triplet)
#define USB_BATCH_BYTES     768

static uint8_t g_pui8USBBatch[USB_BATCH_BYTES];

// Pending status triplets (command echoes, overflow reports, stall recoveries).
//
// Status must never be dropped: a vanished overflow report hides data loss, and
// a lost command echo leaves the GUI's indicators disagreeing with the firmware.
// Reserving space at the top of the TX buffer did not work -- under sustained
// saturation the stream still consumed it and status went out at zero packets
// per second.  Queue status instead and hand it the buffer BEFORE bulk data, so
// it is retried until it fits rather than discarded.  The cost is negligible:
// at 400 kS/s the overflow rate needs ~39 triplets/s, ~120 B/s out of ~358 kB/s.
#define STATUS_QUEUE_SIZE   16      // power of 2
#define STATUS_QUEUE_MASK   (STATUS_QUEUE_SIZE - 1)
static volatile uint8_t g_pui8StatusQueue[STATUS_QUEUE_SIZE][2];
static volatile uint8_t g_ui8StatusHead = 0;
static volatile uint8_t g_ui8StatusTail = 0;


// uDMA control table — must be 1024-byte aligned in SRAM
static uint8_t g_pui8DMAControlTable[1024] __attribute__((aligned(1024)));

// DMA ping-pong buffers (32-bit: ADC FIFO register is 32-bit)
#define DMA_BUFFER_SIZE     256
static uint32_t g_pui32DMABufA[DMA_BUFFER_SIZE];
static uint32_t g_pui32DMABufB[DMA_BUFFER_SIZE];

//*****************************************************************************
// Error handler (DEBUG builds only)
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
    while(1)
    {
    }
}
#endif

//*****************************************************************************
// PWM helper: apply current frequency and duty settings
//*****************************************************************************
static void
PWMApplySettings(void)
{
    const tPWMFreqPreset *psFreq = &g_psFreqPresets[g_ui8FreqIndex];
    uint32_t ui32PulseWidth;

    //
    // Compute pulse width from period and duty percentage
    //
    ui32PulseWidth = psFreq->ui32Period * g_pui8DutyPercent[g_ui8DutyIndex]
                     / 100;
    if(ui32PulseWidth < 1) ui32PulseWidth = 1;
    if(ui32PulseWidth >= psFreq->ui32Period) ui32PulseWidth = psFreq->ui32Period - 1;

    //
    // Disable output, reconfigure, re-enable
    //
    MAP_PWMOutputState(PWM0_BASE, PWM_OUT_0_BIT, false);
    MAP_PWMGenDisable(PWM0_BASE, PWM_GEN_0);

    MAP_SysCtlPWMClockSet(psFreq->ui32ClkDiv);
    MAP_PWMGenPeriodSet(PWM0_BASE, PWM_GEN_0, psFreq->ui32Period);
    MAP_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_0, ui32PulseWidth);

    MAP_PWMGenEnable(PWM0_BASE, PWM_GEN_0);
    MAP_PWMOutputState(PWM0_BASE, PWM_OUT_0_BIT, true);
}

//*****************************************************************************
// Timer helper: apply current ADC sample-rate preset
//*****************************************************************************
static void
TimerApplySampleRate(void)
{
    uint32_t ui32Load =
        (SYS_CLOCK_HZ / g_pui32SampleRateHz[g_ui8SampleRateIndex]) - 1;

    MAP_TimerDisable(TIMER0_BASE, TIMER_A);
    MAP_TimerLoadSet(TIMER0_BASE, TIMER_A, ui32Load);
    MAP_TimerEnable(TIMER0_BASE, TIMER_A);
}

//*****************************************************************************
// USB CDC Callbacks
//*****************************************************************************
uint32_t
ControlHandler(void *pvCBData, uint32_t ui32Event,
               uint32_t ui32MsgValue, void *pvMsgData)
{
    switch(ui32Event)
    {
        case USB_EVENT_CONNECTED:
            g_bUSBConfigured = true;
            USBBufferFlush(&g_sTxBuffer);
            USBBufferFlush(&g_sRxBuffer);
            MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);
            break;

        case USB_EVENT_DISCONNECTED:
            g_bUSBConfigured = false;
            MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
            break;

        case USBD_CDC_EVENT_GET_LINE_CODING:
        case USBD_CDC_EVENT_SET_LINE_CODING:
            break;

        case USBD_CDC_EVENT_SET_CONTROL_LINE_STATE:
            //
            // Host opened (or closed) the COM port.  When DTR is asserted
            // the host just opened the port: flush any in-progress TX data so
            // the new reader starts at a clean triplet boundary.
            //
            if(ui32MsgValue & 0x01)     // bit 0 = DTR
            {
                USBBufferFlush(&g_sTxBuffer);
            }
            break;

        case USBD_CDC_EVENT_SEND_BREAK:
        case USBD_CDC_EVENT_CLEAR_BREAK:
        case USB_EVENT_SUSPEND:
        case USB_EVENT_RESUME:
            break;

        default:
            break;
    }

    return(0);
}

uint32_t
TxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    return(0);
}

uint32_t
RxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    switch(ui32Event)
    {
        case USB_EVENT_RX_AVAILABLE:
        {
            uint8_t ui8Char;
            static uint8_t ui8RxState = 0;

            while(USBBufferRead((tUSBBuffer *)&g_sRxBuffer, &ui8Char, 1))
            {
                //
                // Two-byte command: [0xFE] [0x20|freq_idx] or [0xFE] [0x40|duty_idx]
                //
                if(ui8RxState == 0)
                {
                    if(ui8Char == 0xFE)
                        ui8RxState = 1;
                }
                else
                {
                    ui8RxState = 0;
                    if((ui8Char & 0x60) == 0x20)
                    {
                        uint8_t idx = ui8Char & 0x0F;
                        if(idx < NUM_FREQ_PRESETS)
                        {
                            g_ui8CmdFreqIndex = idx;
                            g_bCmdFreq = true;
                        }
                    }
                    else if((ui8Char & 0x60) == 0x40)
                    {
                        uint8_t idx = ui8Char & 0x0F;
                        if(idx < NUM_DUTY_PRESETS)
                        {
                            g_ui8CmdDutyIndex = idx;
                            g_bCmdDuty = true;
                        }
                    }
                    else if((ui8Char & 0x60) == 0x60)
                    {
                        uint8_t idx = ui8Char & 0x0F;
                        if(idx < NUM_SAMPLE_RATE_PRESETS)
                        {
                            g_ui8CmdSampleRateIndex = idx;
                            g_bCmdSampleRate = true;
                        }
                    }
                }
            }
            break;
        }

        case USB_EVENT_DATA_REMAINING:
            return(0);

        case USB_EVENT_REQUEST_BUFFER:
            return(0);

        default:
            break;
    }

    return(0);
}

//*****************************************************************************
// Debounce helper — called from SysTick for each button
//*****************************************************************************
static inline void
DebounceButton(uint32_t ui32Idx, uint8_t ui8Raw)
{
    if(ui8Raw != g_sButtons[ui32Idx].ui8State)
    {
        g_sButtons[ui32Idx].ui8Count++;
        if(g_sButtons[ui32Idx].ui8Count >= DEBOUNCE_TICKS)
        {
            g_sButtons[ui32Idx].ui8State = ui8Raw;
            g_sButtons[ui32Idx].ui8Count = 0;
            if(ui8Raw == 0)                 // Just pressed (active low)
            {
                g_sButtons[ui32Idx].bPressed = true;
            }
        }
    }
    else
    {
        g_sButtons[ui32Idx].ui8Count = 0;
    }
}

//*****************************************************************************
// SysTick ISR — button debounce and heartbeat LED
//*****************************************************************************
void
SysTickIntHandler(void)
{
    g_ui32SysTickCount++;

    //
    // Poll both buttons (active low: read != 0 means released)
    //
    uint32_t ui32PortF = MAP_GPIOPinRead(GPIO_PORTF_BASE,
                                          GPIO_PIN_4 | GPIO_PIN_0);
    DebounceButton(BTN_FREQ, (ui32PortF & GPIO_PIN_4) ? 1 : 0);
    DebounceButton(BTN_DUTY, (ui32PortF & GPIO_PIN_0) ? 1 : 0);

    //
    // Acquisition watchdog.  If both ping-pong halves are ever left in
    // UDMA_MODE_STOP -- an ISR delayed past a full buffer, or a debugger halt --
    // nothing re-arms them and sampling stops silently with USB still up.
    // Detect here; repair from the main loop where the ADC ISR can be masked.
    //
    if(g_ui32SampleCount == g_ui32WatchdogLast)
    {
        if(++g_ui8WatchdogTicks >= WATCHDOG_TICKS)
        {
            g_ui8WatchdogTicks = 0;
            g_bPipelineStalled = true;
        }
    }
    else
    {
        g_ui32WatchdogLast = g_ui32SampleCount;
        g_ui8WatchdogTicks = 0;
    }

    //
    // Heartbeat: toggle red LED every 500ms
    //
    if((g_ui32SysTickCount % 50) == 0)
    {
        MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_1,
            MAP_GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1) ^ GPIO_PIN_1);
    }
}

//*****************************************************************************
// Process a completed DMA buffer into the ADC ring buffer
//*****************************************************************************
static void
ProcessDMABuffer(uint32_t *pui32Buf, uint32_t ui32Count)
{
    uint32_t i;
    for(i = 0; i < ui32Count; i++)
    {
        uint32_t ui32Next = (g_ui32ADCHead + 1) & ADC_BUFFER_MASK;
        if(ui32Next != g_ui32ADCTail)
        {
            g_pui16ADCBuffer[g_ui32ADCHead] = (uint16_t)(pui32Buf[i] & 0xFFF);
            g_ui32ADCHead = ui32Next;
        }
        else
        {
            g_ui32ADCOverflow += (ui32Count - i);
            break;
        }
    }
    g_ui32SampleCount += ui32Count;
}

//*****************************************************************************
// ADC0 Sequence 3 ISR — uDMA ping-pong completion
//
// With DMA enabled, this fires per-buffer (128 samples), NOT per sample.
// At 500 kHz: ~3.9 kHz interrupt rate (vs 500 kHz without DMA).
//*****************************************************************************
void
ADC0Seq3Handler(void)
{
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3);

    //
    // Check primary buffer (A) — UDMA_MODE_STOP means transfer complete
    //
    if(MAP_uDMAChannelModeGet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT)
       == UDMA_MODE_STOP)
    {
        ProcessDMABuffer(g_pui32DMABufA, DMA_BUFFER_SIZE);

        MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
            UDMA_MODE_PINGPONG,
            (void *)(ADC0_BASE + ADC_O_SSFIFO3),
            g_pui32DMABufA, DMA_BUFFER_SIZE);
    }

    //
    // Check alternate buffer (B)
    //
    if(MAP_uDMAChannelModeGet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT)
       == UDMA_MODE_STOP)
    {
        ProcessDMABuffer(g_pui32DMABufB, DMA_BUFFER_SIZE);

        MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
            UDMA_MODE_PINGPONG,
            (void *)(ADC0_BASE + ADC_O_SSFIFO3),
            g_pui32DMABufB, DMA_BUFFER_SIZE);
    }

    //
    // Toggle green LED every ~131072 samples (~0.7s at 192kHz, gentle blink)
    //
    if((g_ui32SampleCount & 0x1FFFF) == 0)
    {
        MAP_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_3,
            MAP_GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_3) ^ GPIO_PIN_3);
    }
}

//*****************************************************************************
// Peripheral initialization
//*****************************************************************************
static void
ConfigureSystemClock(void)
{
    //
    // 80 MHz: 16MHz xtal -> PLL 400MHz -> /2 -> /2.5 = 80MHz
    //
    MAP_SysCtlClockSet(SYSCTL_SYSDIV_2_5 | SYSCTL_USE_PLL |
                       SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);
}

static void
ConfigureGPIO(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

