daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOF)) {}

    //
    // Unlock PF0 (NMI pin) so it can be used as SW2 button input
    //
    HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
    HWREG(GPIO_PORTF_BASE + GPIO_O_CR) |= GPIO_PIN_0;
    HWREG(GPIO_PORTF_BASE + GPIO_O_LOCK) = 0;

    //
    // RGB LED outputs: PF1 (Red), PF2 (Blue), PF3 (Green)
    //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE,
                              GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);

    //
    // SW1 (PF4) and SW2 (PF0): active low, internal pull-up
    //
    MAP_GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_4 | GPIO_PIN_0);
    MAP_GPIOPadConfigSet(GPIO_PORTF_BASE, GPIO_PIN_4 | GPIO_PIN_0,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    //
    // USB pins: PD4 (D-), PD5 (D+)
    //
    MAP_GPIOPinTypeUSBAnalog(GPIO_PORTD_BASE, GPIO_PIN_4 | GPIO_PIN_5);
}

static void
ConfigureADC(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_ADC0)) {}

    //
    // PE3 = AIN0
    //
    MAP_GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_3);

    //
    // ADC0 Sequencer 3: single sample, Timer0A trigger, highest priority
    //
    MAP_ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_TIMER, 0);
    MAP_ADCSequenceStepConfigure(ADC0_BASE, 3, 0,
                                 ADC_CTL_CH0 | ADC_CTL_IE | ADC_CTL_END);
    MAP_ADCSequenceEnable(ADC0_BASE, 3);

    //
    // Enable uDMA for SS3 — DMA request replaces per-sample CPU interrupt.
    // CPU interrupt fires only on DMA buffer completion (every 128 samples).
    //
    ADCSequenceDMAEnable(ADC0_BASE, 3);

    //
    // Interrupt on DMA completion rather than sequence completion.  With uDMA
    // driving SS3 the sequence interrupt is the wrong source: clearing it does
    // not acknowledge the DMA-done condition, so the two can drift apart.
    //
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3 | ADC_INT_SS3);
    MAP_ADCIntEnableEx(ADC0_BASE, ADC_INT_DMA_SS3);
    MAP_IntEnable(INT_ADC0SS3);
}

//*****************************************************************************
// (Re)program both uDMA ping-pong halves and restart the channel.
//
// Used both for first-time setup and by the watchdog to recover a stalled
// pipeline.  Safe to call with the channel already running provided the ADC
// interrupt is masked by the caller.
//*****************************************************************************
static void
ADCPipelineRearm(void)
{
    //
    // Stop the channel and drain anything left in the SS3 FIFO, so the first
    // DMA transfer after the restart is a fresh conversion rather than a stale
    // one captured while the pipeline was wedged.
    //
    MAP_uDMAChannelDisable(UDMA_CHANNEL_ADC3);

    while(!(HWREG(ADC0_BASE + ADC_O_SSFSTAT3) & ADC_SSFSTAT3_EMPTY))
    {
        (void)HWREG(ADC0_BASE + ADC_O_SSFIFO3);
    }

    //
    // Primary control: ADC0 SS3 FIFO -> Buffer A
    // 32-bit transfers, source fixed, dest increment, arb after each transfer
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
        UDMA_SIZE_32 | UDMA_SRC_INC_NONE | UDMA_DST_INC_32 | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_PRI_SELECT,
        UDMA_MODE_PINGPONG,
        (void *)(ADC0_BASE + ADC_O_SSFIFO3),
        g_pui32DMABufA, DMA_BUFFER_SIZE);

    //
    // Alternate control: ADC0 SS3 FIFO -> Buffer B
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
        UDMA_SIZE_32 | UDMA_SRC_INC_NONE | UDMA_DST_INC_32 | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_ADC3 | UDMA_ALT_SELECT,
        UDMA_MODE_PINGPONG,
        (void *)(ADC0_BASE + ADC_O_SSFIFO3),
        g_pui32DMABufB, DMA_BUFFER_SIZE);

    //
    // Enable the channel — DMA will start on the next ADC trigger
    //
    MAP_ADCIntClearEx(ADC0_BASE, ADC_INT_DMA_SS3);
    MAP_uDMAChannelEnable(UDMA_CHANNEL_ADC3);
}

static void
ConfigureDMA(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_UDMA)) {}

    MAP_uDMAEnable();
    MAP_uDMAControlBaseSet(g_pui8DMAControlTable);

    //
    // Channel 17 = ADC0 SS3 (default assignment on TM4C123G).
    // Clear all attributes, then enable high priority.
    //
    MAP_uDMAChannelAttributeDisable(UDMA_CHANNEL_ADC3,
        UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
        UDMA_ATTR_HIGH_PRIORITY | UDMA_ATTR_REQMASK);
    MAP_uDMAChannelAttributeEnable(UDMA_CHANNEL_ADC3,
        UDMA_ATTR_HIGH_PRIORITY);

    //
    // Program both ping-pong halves and start the channel
    //
    ADCPipelineRearm();
}

static void
ConfigureTimer(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_TIMER0)) {}

    //
    // Full-width periodic timer, hardware ADC trigger output
    //
    MAP_TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);
    MAP_TimerControlTrigger(TIMER0_BASE, TIMER_A, true);
    TimerApplySampleRate();
}

static void
ConfigurePWM(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0)) {}

    //
    // PB6 = M0PWM0
    //
    MAP_GPIOPinConfigure(GPIO_PB6_M0PWM0);
    MAP_GPIOPinTypePWM(GPIO_PORTB_BASE, GPIO_PIN_6);

    //
    // PWM0 Gen0: count-down mode, no sync
    //
    MAP_PWMGenConfigure(PWM0_BASE, PWM_GEN_0,
                        PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);

    //
    // Apply initial frequency and duty (10 kHz, 50%)
    //
    PWMApplySettings();
}

static void
ConfigureUSB(void)
{
    USBBufferInit(&g_sTxBuffer);
    USBBufferInit(&g_sRxBuffer);
    USBStackModeSet(0, eUSBModeForceDevice, 0);
    USBDCDCInit(0, &g_sCDCDevice);
}

//*****************************************************************************
// Queue one status triplet [0xFF][ui8B1][ui8B2] for transmission
//*****************************************************************************
static bool
QueueStatus(uint8_t ui8B1, uint8_t ui8B2)
{
    uint8_t ui8Next = (g_ui8StatusHead + 1) & STATUS_QUEUE_MASK;

    if(ui8Next == g_ui8StatusTail)
    {
        return(false);              // queue full; caller retries later
    }

