daveyJ-sgs/tm4c_daq/usb_dev_serial/main.c
                if(ui32Bytes)
                {
                    USBBufferWrite(&g_sTxBuffer, g_pui8USBBatch, ui32Bytes);
                    g_ui32ADCTail = ui32Tail;
                }
            }
        }
        else
        {
            //
            // Not connected: discard samples to prevent overflow
            //
            g_ui32ADCTail = g_ui32ADCHead;
            g_ui32OverflowReported = g_ui32ADCOverflow;
            g_ui8StatusTail = g_ui8StatusHead;   // discard stale status
        }

        //
        // SW1: cycle PWM frequency
        //
        if(g_sButtons[BTN_FREQ].bPressed)
        {
            g_sButtons[BTN_FREQ].bPressed = false;
            g_ui8FreqIndex = (g_ui8FreqIndex + 1) % NUM_FREQ_PRESETS;
            PWMApplySettings();
            SendUSBCommand(0x20 | g_ui8FreqIndex);
        }

        //
        // SW2: cycle PWM duty
        //
        if(g_sButtons[BTN_DUTY].bPressed)
        {
            g_sButtons[BTN_DUTY].bPressed = false;
            g_ui8DutyIndex = (g_ui8DutyIndex + 1) % NUM_DUTY_PRESETS;
            PWMApplySettings();
            SendUSBCommand(0x40 | g_ui8DutyIndex);
        }

        //
        // PC commands: set frequency
        //
        if(g_bCmdFreq)
        {
            g_bCmdFreq = false;
            g_ui8FreqIndex = g_ui8CmdFreqIndex;
            PWMApplySettings();
            SendUSBCommand(0x20 | g_ui8FreqIndex);
        }

        //
        // PC commands: set duty cycle
        //
        if(g_bCmdDuty)
        {
            g_bCmdDuty = false;
            g_ui8DutyIndex = g_ui8CmdDutyIndex;
            PWMApplySettings();
            SendUSBCommand(0x40 | g_ui8DutyIndex);
        }

        //
        // PC commands: set ADC sample rate
        //
        if(g_bCmdSampleRate)
        {
            g_bCmdSampleRate = false;
            g_ui8SampleRateIndex = g_ui8CmdSampleRateIndex;
            TimerApplySampleRate();
            SendUSBCommand(0x60 | g_ui8SampleRateIndex);
        }
    }
}
